#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.my_batch_resources.aws_iam_role.batch_role will be created
  + resource "aws_iam_role" "batch_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "batch.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "batch_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CreateBy"       = "terraform"
          + "Environment"    = "dev"
          + "Project"        = "learning"
          + "ResourceGrouop" = "dev-learning"
        }
      + tags_all              = {
          + "CreateBy"       = "terraform"
          + "Environment"    = "dev"
          + "Project"        = "learning"
          + "ResourceGrouop" = "dev-learning"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.my_batch_resources.aws_iam_role_policy_attachment.policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole"
      + role       = "batch_role"
    }

  # module.my_batch_resources.aws_security_group.batch_security_group will be created
  + resource "aws_security_group" "batch_security_group" {
      + arn                    = (known after apply)
      + description            = "AWS Batch Security Group for batch jobs"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "batch_security_group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CreateBy"       = "terraform"
          + "Environment"    = "dev"
          + "Project"        = "learning"
          + "ResourceGrouop" = "dev-learning"
        }
      + tags_all               = {
          + "CreateBy"       = "terraform"
          + "Environment"    = "dev"
          + "Project"        = "learning"
          + "ResourceGrouop" = "dev-learning"
        }
      + vpc_id                 = "vpc-0ca742f001add2687"
    }

  # module.my_cloudwatch_resources.aws_cloudwatch_log_group.hello_world will be created
  + resource "aws_cloudwatch_log_group" "hello_world" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/HelloWorld"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # module.my_iam_resources.aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "serverless_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.my_iam_resources.aws_iam_role_policy_attachment.lambda_exec_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_exec_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "serverless_lambda"
    }

  # module.my_lambda_resources.aws_lambda_function.hello_world will be created
  + resource "aws_lambda_function" "hello_world" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "HelloWorld"
      + handler                        = "hello.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + s3_bucket                      = (known after apply)
      + s3_key                         = "hello-world.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "ZTigJ3I3xUCNSDdmt7vhVoTbTGxTTsCD8qC+8niAhSI="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.my_lambda_resources.aws_s3_bucket.bucket1 will be created
  + resource "aws_s3_bucket" "bucket1" {
      + acceleration_status                  = (known after apply)
      + acl                                  = (known after apply)
      + arn                                  = (known after apply)
      + bucket                               = "dev-learning-grahamwright.net"
      + bucket_domain_name                   = (known after apply)
      + bucket_regional_domain_name          = (known after apply)
      + cors_rule                            = (known after apply)
      + force_destroy                        = false
      + grant                                = (known after apply)
      + hosted_zone_id                       = (known after apply)
      + id                                   = (known after apply)
      + lifecycle_rule                       = (known after apply)
      + logging                              = (known after apply)
      + object_lock_enabled                  = (known after apply)
      + policy                               = (known after apply)
      + region                               = (known after apply)
      + replication_configuration            = (known after apply)
      + request_payer                        = (known after apply)
      + server_side_encryption_configuration = (known after apply)
      + tags                                 = {
          + "CreatedBy"      = "terraform"
          + "Environment"    = "dev"
          + "Project"        = "learning"
          + "ResourceGrouop" = "dev-learning"
        }
      + tags_all                             = {
          + "CreatedBy"      = "terraform"
          + "Environment"    = "dev"
          + "Project"        = "learning"
          + "ResourceGrouop" = "dev-learning"
        }
      + versioning                           = (known after apply)
      + website                              = (known after apply)
      + website_domain                       = (known after apply)
      + website_endpoint                     = (known after apply)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)
          + rule                = (known after apply)
        }
    }

  # module.my_lambda_resources.aws_s3_bucket_acl.bucket1 will be created
  + resource "aws_s3_bucket_acl" "bucket1" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.my_lambda_resources.aws_s3_object.lambda_hello_world will be created
  + resource "aws_s3_object" "lambda_hello_world" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "8e6d8a090c1f33b6dabbc6cc6cd1b94a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "hello-world.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/gitops/gitops/src/hello-world.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + root_path = "/home/runner/work/gitops/gitops"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @gwright99, Action: `pull_request`, Working Directory: ``, Workflow: `Deploy Infrastructure With TF`*